$.class(appname + '.store.blog.BlogStore', {
  extend: 'Ext.data.Store',
  alias: 'store.blogs',
  model: appname + '.model.blog.BlogModel',
  data: [{
    'title': 'Cookie - قسمت اول',
    'author': 'یوسف نژاد',
    'uploadDate': 'شنبه 11 خرداد 1391',
    'viewsCount': 'بازدید 2354',
    'content': 'مدت زیادی است که کوکی‌ها در عرصه وب نقش مهمی ایفا میکنند، اما متاسفانه مفهوم روشن و واضحی از آن و نحوه کار آن در اختیار اکثر کاربران و توسعه دهندگان وب نیست. شاید اولین مشکل ناشی از سوءتفاهم‌های بسیاری باشد که درباره کوکی وجود دارد. مثلا برخی آن را ابزاری صرفا برای جاسوسی از کاربران اینترنتی میدانند. برخی دیگر، از آنها و نحوه کارکردشان کلا صرفنظر میکنند. مشکل دیگری که در رابطه با کوکی‌ها میتوان برشمرد، عدم وجود رابط کاربری مناسب برای بررسی و مدیریت کوکی هاست. اما با وجود این مشکلات و برخی دیگر امروزه کوکی‌ها جزئی بسیار مهم در وب هستند که درصورت حذفشان، بسیاری از وب سایتها و برنامه‌های مبتنی بر وب از کار خواهند افتاد.'
  }, {
    'title': 'Cookie - قسمت دوم',
    'author': 'یوسف نژاد',
    'uploadDate': 'سه شنبه 27 مرداد 1391',
    'viewsCount': 'بازدید 1354',
    'content': 'همانطور که در قسمت قبل اشاره کوتاهی شد، مدیریت کوکی‌های در دسترس در وضعیت جاری، در جاوا اسکریپت ازطریق پراپرتی cookie از شی document امکان‌پذیر است. این پراپرتی کاری همانند هدرهای Set-Cookie و Cookie (که در قسمت قبل درباره آن‌ها بحث شد) انجام می‌دهد. این پراپرتی یک مورد کاملا استثنایی و نسبتا عجیب در زبان جاوا اسکریپت است. در نگاه اول ظاهرا document.cookie از نوع رشته است، اما قضیه کاملا فرق می‌کند. برای روشن شدن مطلب به ادامه بحث توجه کنید.'
  }, {
    'title': 'Cookie - قسمت سوم',
    'author': 'یوسف نژاد',
    'uploadDate': 'یک شنبه 17 مهر 1391',
    'viewsCount': 'بازدید 1031',
    'content': 'در قسمت‌های قبلی مقدمات و مباحث کلی راجع به کوکی‌ها و انواع آن، شرح کامل خواص، نحوه رفتار مرورگرها با انواع کوکی‌ها و درنهایت نحوه کار کردن با کوکی‌ها در سمت کلاینت با استفاده از زبان محبوب جاوا اسکریپت پرداخته شد.'
  }, {
    'title': 'Cookie - قسمت چهارم',
    'author': 'یوسف نژاد',
    'uploadDate': 'چهار شنبه 28 آبان 1391',
    'viewsCount': 'بازدید 847',
    'content': 'در قسمت‌های قبلی مقدمات و مباحث کلی راجع به کوکی‌ها و انواع آن، شرح کامل خواص، نحوه رفتار مرورگرها با انواع کوکی‌ها و درنهایت نحوه کار کردن با کوکی‌ها در سمت کلاینت با استفاده از زبان محبوب جاوا اسکریپت پرداخته شد.'
  }, {
    'title': 'Cookie - قسمت پنجم',
    'author': 'یوسف نژاد',
    'uploadDate': 'دو شنبه 7 دی 1391',
    'viewsCount': 'بازدید 847',
    'content': 'در قسمت‌های قبلی مقدمات و مباحث کلی راجع به کوکی‌ها و انواع آن، شرح کامل خواص، نحوه رفتار مرورگرها با انواع کوکی‌ها و درنهایت نحوه کار کردن با کوکی‌ها در سمت کلاینت با استفاده از زبان محبوب جاوا اسکریپت پرداخته شد.'
  }, {
    'title': 'Cookie - قسمت ششم',
    'author': 'یوسف نژاد',
    'uploadDate': 'پنج شنبه 13 بهمن 1391',
    'viewsCount': 'بازدید 784',
    'content': 'در قسمت‌های قبلی مقدمات و مباحث کلی راجع به کوکی‌ها و انواع آن، شرح کامل خواص، نحوه رفتار مرورگرها با انواع کوکی‌ها و درنهایت نحوه کار کردن با کوکی‌ها در سمت کلاینت با استفاده از زبان محبوب جاوا اسکریپت پرداخته شد.'
  }, {
    'title': 'Cookie - قسمت هفتم',
    'author': 'یوسف نژاد',
    'uploadDate': 'شنبه 19 اسفند 1391',
    'viewsCount': 'بازدید 695',
    'content': 'در قسمت‌های قبلی مقدمات و مباحث کلی راجع به کوکی‌ها و انواع آن، شرح کامل خواص، نحوه رفتار مرورگرها با انواع کوکی‌ها و درنهایت نحوه کار کردن با کوکی‌ها در سمت کلاینت با استفاده از زبان محبوب جاوا اسکریپت پرداخته شد.'
  }, ]
});